tests/load/artillery-config.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 1
      name: 'Warm-up'
    # Ramp-up phase
    - duration: 60
      arrivalRate: 10
      name: 'Ramp-up'
    # Sustained load phase
    - duration: 120
      arrivalRate: 50
      name: 'Sustained load'
    # Peak load phase
    - duration: 60
      arrivalRate: 100
      name: 'Peak load'
    # Cool-down phase
    - duration: 30
      arrivalRate: 10
      name: 'Cool-down'

  payload:
    path: 'tests/load/data/test-users.csv'
    fields:
      - 'email'
      - 'password'
      - 'orgId'

  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    publish-metrics:
      - type: datadog
        apiKey: '{{ $processEnvironment.DATADOG_API_KEY }}'
        prefix: 'artillery'
        tags:
          - 'environment:test'
          - 'service:formaos'

  processor: 'tests/load/processors/auth-processor.js'

  variables:
    apiUrl: 'http://localhost:3000/api'

scenarios:
  # User Authentication Flow
  - name: 'Authentication Flow'
    weight: 30
    flow:
      - function: 'setTestUser'
      - post:
          url: '/api/auth/signin'
          name: 'Auth - Sign In'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
          capture:
            - json: '$.access_token'
              as: 'authToken'
            - json: '$.user.id'
              as: 'userId'
      - think: 2
      - get:
          url: '/app'
          name: 'Dashboard - Load'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - think: 3

  # Dashboard and Navigation
  - name: 'Dashboard Navigation'
    weight: 25
    flow:
      - function: 'setAuthenticatedUser'
      - get:
          url: '/app'
          name: 'Dashboard - Home'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - think: 2
      - get:
          url: '/app/policies'
          name: 'Policies - List'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - think: 3
      - get:
          url: '/app/tasks'
          name: 'Tasks - List'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - think: 2
      - get:
          url: '/app/team'
          name: 'Team - List'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - think: 1

  # Policy Management
  - name: 'Policy Management'
    weight: 20
    flow:
      - function: 'setAuthenticatedUser'
      - get:
          url: '/app/policies'
          name: 'Policies - List'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - think: 2
      - post:
          url: '/api/policies'
          name: 'Policy - Create'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          json:
            title: 'Load Test Policy {{ $timestamp }}'
            description: 'Policy created during load testing'
            category: 'general'
            frequency: 'monthly'
            organizationId: '{{ orgId }}'
          capture:
            - json: '$.id'
              as: 'policyId'
      - think: 3
      - get:
          url: '/api/policies/{{ policyId }}'
          name: 'Policy - Get Details'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - think: 2
      - put:
          url: '/api/policies/{{ policyId }}'
          name: 'Policy - Update'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          json:
            title: 'Updated Load Test Policy {{ $timestamp }}'
            description: 'Updated during load testing'
      - think: 1

  # Task Management
  - name: 'Task Management'
    weight: 15
    flow:
      - function: 'setAuthenticatedUser'
      - get:
          url: '/app/tasks'
          name: 'Tasks - List'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - think: 2
      - post:
          url: '/api/tasks'
          name: 'Task - Create'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          json:
            title: 'Load Test Task {{ $timestamp }}'
            description: 'Task created during load testing'
            priority: 'medium'
            dueDate: '2026-02-15'
            organizationId: '{{ orgId }}'
          capture:
            - json: '$.id'
              as: 'taskId'
      - think: 1
      - patch:
          url: '/api/tasks/{{ taskId }}'
          name: 'Task - Update Status'
          headers:
            Authorization: 'Bearer {{ authToken }}'
          json:
            status: 'in_progress'
      - think: 2

  # Real-time Updates (WebSocket simulation)
  - name: 'Real-time Updates'
    weight: 10
    flow:
      - function: 'setAuthenticatedUser'
      - get:
          url: '/api/notifications'
          name: 'Notifications - Poll'
          headers:
            Authorization: 'Bearer {{ authToken }}'
      - loop:
          - get:
              url: '/api/activity-feed'
              name: 'Activity Feed - Poll'
              headers:
                Authorization: 'Bearer {{ authToken }}'
          - think: 5
        count: 5