tests/load/artillery-config.yml
# Artillery load test for FormaOS — v4-031 rewrite.
#
# The previous version POSTed to /api/auth/signin, /api/policies,
# /api/tasks, /api/team — paths that don't exist under that shape.
# Mutating endpoints live under /api/v1/* and require Bearer fos_…
# API keys, not session cookies. The suite passed visibly because
# every step that 404'd was followed by an assertion that accepted
# any non-5xx status.
#
# This rewrite exercises only public read endpoints that actually
# exist. For authenticated load coverage use the canonical scripts
# under /load-tests (dashboard.js, exports.js, evidence-upload.js)
# which expect FORMAOS_AUTH_COOKIE.

config:
  target: '{{ $processEnvironment.BASE_URL }}'
  phases:
    - duration: 30
      arrivalRate: 1
      name: 'Warm-up'
    - duration: 60
      arrivalRate: 10
      name: 'Ramp-up'
    - duration: 60
      arrivalRate: 25
      name: 'Sustained'
    - duration: 30
      arrivalRate: 5
      name: 'Cool-down'
  defaults:
    target: 'http://localhost:3000'
  ensure:
    p95: 2000
    maxErrorRate: 5

scenarios:
  - name: 'Marketing pages'
    weight: 70
    flow:
      - get:
          url: '/'
          name: 'Marketing - Home'
      - think: 1
      - get:
          url: '/pricing'
          name: 'Marketing - Pricing'
      - think: 1
      - get:
          url: '/security'
          name: 'Marketing - Security'

  - name: 'Health surface'
    weight: 30
    flow:
      - get:
          url: '/api/health'
          name: 'Health - root'
          expect:
            - statusCode: 200